import { RegionValue } from "../region";
import { StationId } from "../../data/types";

/**
 * 地方ごとの代表雨温図地点ID一覧
 */
export const REGION_UONZU_STATIONS: Record<RegionValue, StationId[]> = {
  hokkaido: ["14163", "12442", "23232"], // 札幌, 旭川, 函館
  tohoku: ["31312", "33431", "34392"],   // 青森, 盛岡, 仙台
  kanto: ["44132", "43056", "45148"],    // 東京, 熊谷, 銚子
  hokuriku: ["54232", "55102", "56227"], // 新潟, 富山, 金沢
  chubu: ["48361", "51106", "50331"],    // 甲府, 名古屋, 浜松
  kinki: ["63051", "62078", "65356"],    // 舞鶴, 大阪, 潮岬
  chugoku: ["69122", "68132", "66408"],  // 鳥取, 松江, 岡山
  shikoku: ["74182", "72086", "73166"],  // 高知, 高松, 松山
  kyushu: ["82182", "87376", "88686"],   // 福岡, 宮崎, 鹿児島
  okinawa: ["91197", "91107", "94081"],  // 那覇, 名護, 石垣島
};
